{
  "метаданные" : {
    "язык_информация" : {
      "codemirror_mode" : {
        "имя" : " питон " ,
        "версия" : 3
      },
      "расширение_файла" : " .py " ,
      "mimetype" : " текст/x-python " ,
      "имя" : " питон " ,
      "nbconvert_exporter" : " питон " ,
      "pygments_lexer" : " ipython3 " ,
      "версия" : " 3.8 "
    },
    "спецификация ядра" : {
      "имя" : " питон " ,
      "display_name" : " Python (Pyodide) " ,
      "язык" : " питон "
    }
  },
  "nbformat_minor" : 4 ,
  "нбформат" : 4 ,
  "клетки" : [
    {
      "cell_type" : " код " ,
      "источник" : " s=2 \n print(s) " ,
      "метаданные" : {
        "доверенный" : правда
      },
      "количество_выполнений" : 2 ,
      "выход" : [
        {
          "имя" : " стандартный вывод " ,
          "текст" : " 2 \n " ,
          "output_type" : " поток "
        }
      ]
    },
    {
      "cell_type" : " код " ,
      "источник" : " печать(и) " ,
      "метаданные" : {
        "доверенный" : правда
      },
      "количество_выполнений" : 6 ,
      "выход" : [
        {
          "имя" : " стандартный вывод " ,
          "текст" : " 2 \n " ,
          "output_type" : " поток "
        }
      ]
    },
    {
      "cell_type" : " код " ,
      "источник" : " print ('ABCDEFABFBWUYF'. count ( \" F \" )) " ,
      "метаданные" : {
        "доверенный" : правда
      },
      "количество_выполнений" : 8 ,
      "выход" : [
        {
          "имя" : " стандартный вывод " ,
          "текст" : " 3 \n " ,
          "output_type" : " поток "
        }
      ]
    },
    {
      "cell_type" : " код " ,
      "источник" : " a=[1,22,423,61,13,23,14] \n print (max(a)) " ,
      "метаданные" : {
        "доверенный" : правда
      },
      "количество_выполнений" : 10 ,
      "выход" : [
        {
          "имя" : " стандартный вывод " ,
          "текст" : " 423 \n " ,
          "output_type" : " поток "
        }
      ]
    },
    {
      "cell_type" : " код " ,
      "source" : " a=[1,22,423,61,13,23,14] \n k=0 \n for i in a: \n     if i%2==0: \n         k+=1 \n print (к) " ,
      "метаданные" : {
        "доверенный" : правда
      },
      "количество_выполнений" : 12 ,
      "выход" : [
        {
          "имя" : " стандартный вывод " ,
          "текст" : " 2 \n " ,
          "output_type" : " поток "
        }
      ]
    },
    {
      "cell_type" : " код " ,
      "источник" : " k=0 \n l=input() \n for i in a: \n     if l in \" AUYIOE \" : \n         k+=1 \n print (k) " ,
      "метаданные" : {
        "доверенный" : правда
      },
      "количество_выполнений" : 47 ,
      "выход" : [
        {
          "имя" : " <класс 'TypeError'> " ,
          "evalue" : " 'in <string>' требует строки в качестве левого операнда, а не Future " ,
          "трассировка" : [
            " \u001b [0;31м------------------------------------------------------------------------- -------------------------------- \u001b [0m " ,
            " \u001b [0;31mTypeError \u001b [0m Traceback (последний последний вызов) " ,
            Ячейка [ 0; 32mIn [47], строка 4 [0m \ n [1;32m 2 [ 0m l ] [38;5;241m= [39m ] [ 38; 5;28минввод [ 39м ( \u001b [ 38;5;28мстр [39м ( )) \n [1;32м 3 [0м ] [38;5;28; 01мфор [39 ; 00м я [38;5;129; 01мин [39;00м а: \ н [0; 32м ---->4 [      0м[38;5;28;01mif [ 39; 00м [43мл ] [ 49м [ 43м [49м ] [38;5;129;43; 01мин [39;49;00м [ 43м [49м ] [38;5;124; 43м \ " [39;49м [ 38;5;124;43мАУЙИОЭ ] [ 39;49м [38;5;124 ; 43м \ " [39;49м: \n [1;32м 5 ] [0м к [38;5;241м+ ] [ 39м[38;5;241м= [ 39м [38;5;241м1 ] [39м \ н [ 1 ;32м 6 ] [0м[0м ] [38;5;28мотпечаток [ 39м (к) \п " ,
            " \u001b [0;31mTypeError \u001b [0m: 'in <string>' в качестве левого операнда требуется строка, а не Future "
          ],
          "output_type" : " ошибка "
        },
        {
          "output_type" : " поток " ,
          "имя" : " стандартный ввод " ,
          "текст" : " w5ywy \n "
        }
      ]
    },
    {
      "cell_type" : " код " ,
      «источник» : « a=int(input()) \n b=int(input()) \n s=a*b \n print(s) » ,
      "метаданные" : {
        "доверенный" : правда
      },
      "количество_выполнений" : 48 ,
      "выход" : [
        {
          "имя" : " stderr " ,
          "текст" : " Будущее исключение никогда не было получено \n будущее: <будущее законченное исключение=JsException(DataCloneError: не удалось выполнить 'postMessage' в 'DedicatedWorkerGlobalScope': функция(){} не может быть клонирована.)> \n " ,
          "output_type" : " поток "
        },
        {
          "имя" : " <класс 'TypeError'> " ,
          "evalue" : " Аргумент int() должен быть строкой, байтовым объектом или действительным числом, а не "будущим" " ,
          "трассировка" : [
            " \u001b [0;31м------------------------------------------------------------------------- -------------------------------- \u001b [0m " ,
            " \u001b [0;31mTypeError \u001b [0m Traceback (последний последний вызов) " ,
            " Ячейка [0;32mIn[48], строка 1 [0m \n \ u001b [0; 32m ---->1 [0m a ] [38;5;241m= \ u001b [ 39m [38;5;28; 43минт [39;49м [ 43м ( \ u001b [49м [38;5;28;43минпут ] [39;49м [ 43м ( \ u001b [49м [38;5;28; 43мстр [39;49м [ 43м ] ] [49м [43м ) [ 49м\n [1;32m 2 [ 0m b ] [38;5;241m= [ 39m [38;5;28mint ] [39m( \ u001b [38;5;28minput ] [ 39м ( [38;5;28мстр [39м ) ) \n [1;32м 3 [0м с ] [38;5;241м= [ 39ма [ 38 ;5 ;241м* [39мб \ н " ,
            " \u001b [0;31mTypeError \u001b [0m: аргумент int() должен быть строкой, байтовым объектом или действительным числом, а не 'будущим' "
          ],
          "output_type" : " ошибка "
        }
      ]
    }
  ]
}
